app/Http/Controllers/Frontend/IndexController.php

select * from "useful_links" where "slug" = 'privacy-policy' limit 1
---
    public function usefulLink($slug) {
        $useful_link = UsefulLink::where("slug",$slug)->first();